#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/initialised-si/JoWe-Web-Dev/runs/run-X8q6KPnUvqszTjB1

Waiting for the plan to start...

Terraform v1.5.3
on linux_amd64
Initializing plugins and modules...
module.web.aws_cloudfront_origin_access_identity.jowe_web: Refreshing state... [id=E2WK19VXEQOQCH]
module.web.aws_s3_bucket.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.aws_s3_bucket_versioning.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.aws_s3_bucket_public_access_block.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.data.aws_iam_policy_document.jowe_web_s3_policy: Refreshing...
module.web.aws_s3_bucket_ownership_controls.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.data.aws_iam_policy_document.jowe_web_s3_policy: Refresh complete after 0s [id=3228599042]
module.web.aws_s3_bucket_policy.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.aws_cloudfront_distribution.jowe_web: Refreshing state... [id=E36U11KHAWUB2P]
module.web.aws_s3_bucket_acl.jowe_web: Refreshing state... [id=jowe-dev.initialised.si,private]
module.web.aws_s3_object.upload_webapp["static/js/726.e869980a.chunk.js"]: Refreshing state... [id=static/js/726.e869980a.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/496.c9f3cc61.chunk.js"]: Refreshing state... [id=static/js/496.c9f3cc61.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/924.d545cbce.chunk.js"]: Refreshing state... [id=static/js/924.d545cbce.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/main.9112eb2d.js.map"]: Refreshing state... [id=static/js/main.9112eb2d.js.map]
module.web.aws_s3_object.upload_webapp["manifest.json"]: Refreshing state... [id=manifest.json]
module.web.aws_s3_object.upload_webapp["static/css/915.35ba84bd.chunk.css"]: Refreshing state... [id=static/css/915.35ba84bd.chunk.css]
module.web.aws_s3_object.upload_webapp["static/css/main.af03688d.css.map"]: Refreshing state... [id=static/css/main.af03688d.css.map]
module.web.aws_s3_object.upload_webapp["static/js/106.66034d11.chunk.js.map"]: Refreshing state... [id=static/js/106.66034d11.chunk.js.map]
module.web.aws_s3_object.upload_webapp["favicon.ico"]: Refreshing state... [id=favicon.ico]
module.web.aws_s3_object.upload_webapp["static/js/924.d545cbce.chunk.js.map"]: Refreshing state... [id=static/js/924.d545cbce.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/media/anonymous-male.a323776dc6f4f8a3ceb8.jpg"]: Refreshing state... [id=static/media/anonymous-male.a323776dc6f4f8a3ceb8.jpg]
module.web.aws_s3_object.upload_webapp["static/css/106.872b5878.chunk.css.map"]: Refreshing state... [id=static/css/106.872b5878.chunk.css.map]
module.web.aws_s3_object.upload_webapp["static/js/main.9112eb2d.js.LICENSE.txt"]: Refreshing state... [id=static/js/main.9112eb2d.js.LICENSE.txt]
module.web.aws_s3_object.upload_webapp["static/css/106.872b5878.chunk.css"]: Refreshing state... [id=static/css/106.872b5878.chunk.css]
module.web.aws_s3_object.upload_webapp["static/js/698.1c688865.chunk.js.map"]: Refreshing state... [id=static/js/698.1c688865.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/106.66034d11.chunk.js"]: Refreshing state... [id=static/js/106.66034d11.chunk.js]
module.web.aws_s3_object.upload_webapp["static/css/777.872b5878.chunk.css"]: Refreshing state... [id=static/css/777.872b5878.chunk.css]
module.web.aws_s3_object.upload_webapp["static/media/anonymous-female.9d832d02f50e90f40bbe.jpg"]: Refreshing state... [id=static/media/anonymous-female.9d832d02f50e90f40bbe.jpg]
module.web.aws_s3_object.upload_webapp["static/js/726.e869980a.chunk.js.map"]: Refreshing state... [id=static/js/726.e869980a.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/main.9112eb2d.js"]: Refreshing state... [id=static/js/main.9112eb2d.js]
module.web.aws_s3_object.upload_webapp["index.html"]: Refreshing state... [id=index.html]
module.web.aws_s3_object.upload_webapp["static/js/356.ab45c9e7.chunk.js.LICENSE.txt"]: Refreshing state... [id=static/js/356.ab45c9e7.chunk.js.LICENSE.txt]
module.web.aws_s3_object.upload_webapp["static/js/915.8e18decd.chunk.js"]: Refreshing state... [id=static/js/915.8e18decd.chunk.js]
module.web.aws_s3_object.upload_webapp["static/css/main.af03688d.css"]: Refreshing state... [id=static/css/main.af03688d.css]
module.web.aws_s3_object.upload_webapp["static/js/777.4dc86836.chunk.js.map"]: Refreshing state... [id=static/js/777.4dc86836.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/css/777.872b5878.chunk.css.map"]: Refreshing state... [id=static/css/777.872b5878.chunk.css.map]
module.web.aws_s3_object.upload_webapp["static/js/496.c9f3cc61.chunk.js.map"]: Refreshing state... [id=static/js/496.c9f3cc61.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/356.ab45c9e7.chunk.js"]: Refreshing state... [id=static/js/356.ab45c9e7.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/915.8e18decd.chunk.js.map"]: Refreshing state... [id=static/js/915.8e18decd.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/css/915.35ba84bd.chunk.css.map"]: Refreshing state... [id=static/css/915.35ba84bd.chunk.css.map]
module.web.aws_s3_object.upload_webapp["static/js/698.1c688865.chunk.js"]: Refreshing state... [id=static/js/698.1c688865.chunk.js]
module.web.aws_s3_object.upload_webapp["asset-manifest.json"]: Refreshing state... [id=asset-manifest.json]
module.web.aws_s3_object.upload_webapp["static/js/356.ab45c9e7.chunk.js.map"]: Refreshing state... [id=static/js/356.ab45c9e7.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/777.4dc86836.chunk.js"]: Refreshing state... [id=static/js/777.4dc86836.chunk.js]
module.web.aws_cloudfront_origin_access_identity.jowe_web: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.web.aws_s3_object.upload_webapp["asset-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "upload_webapp" {
      ~ etag                   = "7d80d4155ca5fb9c04204714eb82d52f" -> "c06bd245f6cecfabdb5abc291644bc5f"
        id                     = "asset-manifest.json"
        tags                   = {}
      ~ version_id             = "fr8msL_kuvYKA7He7bVU1aeG2QmLROYz" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.web.aws_s3_object.upload_webapp["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "upload_webapp" {
      ~ etag                   = "e5d7208234a533f4ebfce84089d5aece" -> "b44f4c859177baaa19274dad0eeb329f"
        id                     = "index.html"
        tags                   = {}
      ~ version_id             = "vVnKKzKL1sqJP_aK80nlAQgZ2aiyaVAS" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.web.aws_s3_object.upload_webapp["static/css/463.ffa5fc90.chunk.css"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/css; charset=utf-8"
      + etag                   = "20120204e50d287252d4e9c7f377394e"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/css/463.ffa5fc90.chunk.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/css/463.ffa5fc90.chunk.css"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/css/463.ffa5fc90.chunk.css.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "5bf5713184ab8ddae626cf52903d6de8"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/css/463.ffa5fc90.chunk.css.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/css/463.ffa5fc90.chunk.css.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/css/915.35ba84bd.chunk.css"] will be destroyed
  # (because key ["static/css/915.35ba84bd.chunk.css"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/css; charset=utf-8" -> null
      - etag                   = "6c2fd5590c5c2513ecfd992d627816ed" -> null
      - force_destroy          = false -> null
      - id                     = "static/css/915.35ba84bd.chunk.css" -> null
      - key                    = "static/css/915.35ba84bd.chunk.css" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/css/915.35ba84bd.chunk.css" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "mhaduJTx0bxE_dBzZnKFTlNeHTanXBA5" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/css/915.35ba84bd.chunk.css.map"] will be destroyed
  # (because key ["static/css/915.35ba84bd.chunk.css.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "d798a776ea1cf5ed12376c4af3cac80f" -> null
      - force_destroy          = false -> null
      - id                     = "static/css/915.35ba84bd.chunk.css.map" -> null
      - key                    = "static/css/915.35ba84bd.chunk.css.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/css/915.35ba84bd.chunk.css.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "EbgOI7dp104L4a4qOREQxCf14Rssbjkg" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/css/main.af03688d.css"] will be destroyed
  # (because key ["static/css/main.af03688d.css"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/css; charset=utf-8" -> null
      - etag                   = "189f9cf8f9cfb48860798f7d3472214e" -> null
      - force_destroy          = false -> null
      - id                     = "static/css/main.af03688d.css" -> null
      - key                    = "static/css/main.af03688d.css" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/css/main.af03688d.css" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "q4Dtm13RwOa9fQGminITReOj2R3qauF6" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/css/main.af03688d.css.map"] will be destroyed
  # (because key ["static/css/main.af03688d.css.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "692c6929da3c9c0edba61a155802befa" -> null
      - force_destroy          = false -> null
      - id                     = "static/css/main.af03688d.css.map" -> null
      - key                    = "static/css/main.af03688d.css.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/css/main.af03688d.css.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "peFgTjELP2yUxQe0jGpAIPY8foVOhpea" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/css/main.dce9ee63.css"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/css; charset=utf-8"
      + etag                   = "01e7c205a10688ca18d159fd728b306f"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/css/main.dce9ee63.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/css/main.dce9ee63.css"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/css/main.dce9ee63.css.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "e8df89e9b15c8d36ab6734c4ddce4ba9"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/css/main.dce9ee63.css.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/css/main.dce9ee63.css.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/106.66034d11.chunk.js.map"] will be updated in-place
  ~ resource "aws_s3_object" "upload_webapp" {
      ~ etag                   = "402b8418a9a2e80b498ad11b618fe756" -> "9f26c56b79a305cbfafcd6f10d0d56c2"
        id                     = "static/js/106.66034d11.chunk.js.map"
        tags                   = {}
      ~ version_id             = ".zDwDU9UrLtX7P0VAHPmtd033iz7Av_C" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/356.ab45c9e7.chunk.js"] will be destroyed
  # (because key ["static/js/356.ab45c9e7.chunk.js"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "09ca10f1dfcd96f757c65beb386b72a9" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/356.ab45c9e7.chunk.js" -> null
      - key                    = "static/js/356.ab45c9e7.chunk.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/356.ab45c9e7.chunk.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "nYIXa6p2ysIfliid7LQH7IZE1tQoQXzj" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/356.ab45c9e7.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/356.ab45c9e7.chunk.js.LICENSE.txt"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/plain; charset=utf-8" -> null
      - etag                   = "686f404fb6748c84bd90802c573b89fc" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/356.ab45c9e7.chunk.js.LICENSE.txt" -> null
      - key                    = "static/js/356.ab45c9e7.chunk.js.LICENSE.txt" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/356.ab45c9e7.chunk.js.LICENSE.txt" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "_dmmeYwSJz6S.siZc5xkhi7Ks4HAEOkj" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/356.ab45c9e7.chunk.js.map"] will be destroyed
  # (because key ["static/js/356.ab45c9e7.chunk.js.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "f48c12b57f9f00e32637422c8eac9091" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/356.ab45c9e7.chunk.js.map" -> null
      - key                    = "static/js/356.ab45c9e7.chunk.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/356.ab45c9e7.chunk.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "3Ukf923vwIqhsr2YCDCShdnZfrMeISRL" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/373.f0584962.chunk.js"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "bd9b2c858984125ab188ec839d50db57"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/373.f0584962.chunk.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/373.f0584962.chunk.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/373.f0584962.chunk.js.LICENSE.txt"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/plain; charset=utf-8"
      + etag                   = "686f404fb6748c84bd90802c573b89fc"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/373.f0584962.chunk.js.LICENSE.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/373.f0584962.chunk.js.LICENSE.txt"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/373.f0584962.chunk.js.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "e79b4a1b2da3f11b90f57bf8eb5d1ae3"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/373.f0584962.chunk.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/373.f0584962.chunk.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/463.d901d6ca.chunk.js"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "e11b5cbe1ca8a43a469f64bace1dbf0c"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/463.d901d6ca.chunk.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/463.d901d6ca.chunk.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/463.d901d6ca.chunk.js.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "5b17a7853af895df90bf4fd9e7d93351"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/463.d901d6ca.chunk.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/463.d901d6ca.chunk.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/496.c9f3cc61.chunk.js.map"] will be updated in-place
  ~ resource "aws_s3_object" "upload_webapp" {
      ~ etag                   = "38d4bc2e5ff8434c0105d54165fbf8dc" -> "5657711fcbad4a742c4d147afb7587d3"
        id                     = "static/js/496.c9f3cc61.chunk.js.map"
        tags                   = {}
      ~ version_id             = "Qks8ACAZhZ3pO9gCCqWkoBcsS__45Xx2" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/726.23200c89.chunk.js"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "f7f4a89c45799de2c8a1e3ca42336212"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/726.23200c89.chunk.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/726.23200c89.chunk.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/726.23200c89.chunk.js.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "78045a17e8156112aa93d4dea2a68ae9"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/726.23200c89.chunk.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/726.23200c89.chunk.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/726.e869980a.chunk.js"] will be destroyed
  # (because key ["static/js/726.e869980a.chunk.js"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "9fe79362421c77f81aaef81bc999714c" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/726.e869980a.chunk.js" -> null
      - key                    = "static/js/726.e869980a.chunk.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/726.e869980a.chunk.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "xuKAQmVj0OOGKEHjuzcSUbwZrW0gsqxy" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/726.e869980a.chunk.js.map"] will be destroyed
  # (because key ["static/js/726.e869980a.chunk.js.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "1399e449ab9a495cbe256011b57cd5ac" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/726.e869980a.chunk.js.map" -> null
      - key                    = "static/js/726.e869980a.chunk.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/726.e869980a.chunk.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "mJxTkOXc1WEUUZpiDTrxP_L6yDFF_wRQ" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/777.4dc86836.chunk.js.map"] will be updated in-place
  ~ resource "aws_s3_object" "upload_webapp" {
      ~ etag                   = "a5290b86371bea560b8ffaa54d55f1df" -> "0c0c0e30a1e7498fb640a5e363e41555"
        id                     = "static/js/777.4dc86836.chunk.js.map"
        tags                   = {}
      ~ version_id             = "WZIarjyFtEKZ4cVRMW4ChzuwTYWzY.XL" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/915.8e18decd.chunk.js"] will be destroyed
  # (because key ["static/js/915.8e18decd.chunk.js"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "7cf9ac0d35524de42b3188618b1d6cdb" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/915.8e18decd.chunk.js" -> null
      - key                    = "static/js/915.8e18decd.chunk.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/915.8e18decd.chunk.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "sGw4F2PyaX4AoD80L6QAtEjOhOt6jYbx" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/915.8e18decd.chunk.js.map"] will be destroyed
  # (because key ["static/js/915.8e18decd.chunk.js.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "6edfb93745a54808338ae2b2296ee173" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/915.8e18decd.chunk.js.map" -> null
      - key                    = "static/js/915.8e18decd.chunk.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/915.8e18decd.chunk.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "ORykKVWyQK7oAs.Z_Pgn.j3zvkRjAhwt" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/924.d545cbce.chunk.js"] will be destroyed
  # (because key ["static/js/924.d545cbce.chunk.js"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "48473abaac3ae3414761cbbe6def85b9" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/924.d545cbce.chunk.js" -> null
      - key                    = "static/js/924.d545cbce.chunk.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/924.d545cbce.chunk.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "WxQLLDI6JCVRMIDrorvaaKM9yg7EXxFM" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/924.d545cbce.chunk.js.map"] will be destroyed
  # (because key ["static/js/924.d545cbce.chunk.js.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "39758b8e8e8eea4d407cd3619a60faac" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/924.d545cbce.chunk.js.map" -> null
      - key                    = "static/js/924.d545cbce.chunk.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/924.d545cbce.chunk.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "vFYTss.cEbHlBwG7BwJKYX27gJPmjGCt" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/924.eae530bc.chunk.js"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "fb3285e9d59e908413dc9bd29538b467"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/924.eae530bc.chunk.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/924.eae530bc.chunk.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/924.eae530bc.chunk.js.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "39ea10e0d5fe2e4ae59f443892c0c0f0"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/924.eae530bc.chunk.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/924.eae530bc.chunk.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.4c13d8e7.js"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "f5a060385341683fa71f77fcc4d84700"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.4c13d8e7.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/main.4c13d8e7.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.4c13d8e7.js.LICENSE.txt"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/plain; charset=utf-8"
      + etag                   = "ad1529f76e3e9c44d0f3385f7571ad68"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.4c13d8e7.js.LICENSE.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/main.4c13d8e7.js.LICENSE.txt"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.4c13d8e7.js.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "96c8f2c29ca1604523e9a99e155730d0"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.4c13d8e7.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/main.4c13d8e7.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.9112eb2d.js"] will be destroyed
  # (because key ["static/js/main.9112eb2d.js"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "5b3241cccf8c943b26958e1297768feb" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/main.9112eb2d.js" -> null
      - key                    = "static/js/main.9112eb2d.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/main.9112eb2d.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "27poFqw6Tf4pkTGStkUio0rhZHkGtXIP" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.9112eb2d.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/main.9112eb2d.js.LICENSE.txt"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/plain; charset=utf-8" -> null
      - etag                   = "a4057ebfbdec3777985163c58aa2bfb0" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/main.9112eb2d.js.LICENSE.txt" -> null
      - key                    = "static/js/main.9112eb2d.js.LICENSE.txt" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/main.9112eb2d.js.LICENSE.txt" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "9W_pZWHnGeYQpYag.xmsRET5iRNpC1Oi" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.9112eb2d.js.map"] will be destroyed
  # (because key ["static/js/main.9112eb2d.js.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "968a9872a00b370f7de91ecba003db1c" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/main.9112eb2d.js.map" -> null
      - key                    = "static/js/main.9112eb2d.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/main.9112eb2d.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "gbeVPEOSDJtybT5tgHu8Hf39F9PgkPKK" -> null
    }

Plan: 16 to add, 5 to change, 16 to destroy.

```

</details>

*Pushed by: @dependabot[bot], Action: `pull_request`*